WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  return glit_debo_ret_check_next_gpio;
}

//==================================================================
// This code is only used for notifying Meadow.Core for debounce
int mint_meadow_debounce_notification_logic(struct interruptPinMap_s *gpioInfoAddr)
{
  uint8_t newState;
  
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(1, "mint-(debounce)-0x%02x Debounce alone, no Glitch\n", gpioInfoAddr->PinId);
#endif

  switch(gpioInfoAddr->GpioInterruptMode)
  {
    // Perfect debounce filtering is not possible due to the MCU not providing the GPIO
    // state that originally generated the interrupt. Therefore, we must assume that the
    // user is using it correctly and they understand what applications are appropriate.
    // All this is because we cannot accurately read the GPIO state at the instant we receive
    // the interrupt notification, it may have changed. If the desired interrupt mode is
    // 'rising' or 'falling' we assume the state based on the configuration, depending on
    // the MCU to only send the requested types. In the case of 'both' we have no choice
    // but to assume that the last known state was valid and send the opposite state.
    case rqstdintmode_both:
      // Assume the opposite state, that's the best we can do.
      // The LastKnownGpioState was updated after the debounce timeout period.
      newState = gpioInfoAddr->LastKnownGpioState == 1 ? 0 : 1;
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(1, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_both \n", gpioInfoAddr->PinId, newState);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, newState);
      break;

    case rqstdintmode_falling:
      newState = 0;      // Assume high to low transition
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(1, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_falling\n", gpioInfoAddr->PinId, 0);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, newState);
      break;

    case rqstdintmode_rising:
      newState = 1;      // Assume low to high transition
#if MEADOW_INTERRUPT_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(1, "mint-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_rising\n", gpioInfoAddr->PinId, 1);
#endif
      mint_forward_interrupt_to_core(gpioInfoAddr, 1);  
      break;

    case rqstdintmode_none:
    default:
      syslog(LOG_ERR, "%s@%d-0x%02x unexpected case:%d\n",
              __FILE__, __LINE__, gpioInfoAddr->PinId, gpioInfoAddr->GpioInterruptMode);
      break;
  }
  return OK;
}

//===============================================================
// Forward interrupt info to Meadow.Core
int mint_forward_interrupt_to_core(struct interruptPinMap_s *gpioInfoAddr, uint8_t state)
{
  int ret;
  extern mqd_t s_int_queue;

  // Forward to Meadow.Core
  char queue_buffer[MINT_MSG_QUEUE_MSG_SIZE];
  queue_buffer[0] = gpioInfoAddr->PinId;
  queue_buffer[1] = state;

  // This message queue is opened in
  // /Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow-upd.c when the upd
  // is opened
  ret = mq_send(s_int_queue, queue_buffer, MINT_MSG_QUEUE_MSG_SIZE, 0);
  if(ret < 0)
  {
    if(errno == ENOMEM)
    {
      syslog(LOG_ERR, "0x%02x Queue overflow (too fast?)\n", gpioInfoAddr->PinId);
    }
    else
    {
      syslog(LOG_ERR, "%s@%d-0x%02x mq_send failed:%d, errno:%d\n", __FILE__, __LINE__, 
          gpioInfoAddr->PinId, ret, get_errno());
    }
  }

  return ret;
}

//===============================================================
uint8_t mint_read_current_gpio_state(struct interruptPinMap_s *gpioInfoAddr)
{
  uint8_t pinNumb = gpioInfoAddr->PinId & 0x0f;
  uint32_t idrRegisterValues = *((uint32_t *)(gpioInfoAddr->IDRAddress));
  return (idrRegisterValues & (1 << pinNumb)) > 0 ? 1 : 0;
}

//===============================================================
// When an interrupt occurs that must be monitored it is added to this
// list. This list is used by the periodic ISR to time glitch and debounce
// activity. Once the timing has completed it is removed from this list.
void mint_add_to_timed_list_and_incr(struct interruptPinMap_s *gpioInfoAddr)
{
  // Find first empty slot
  for(int i = 0; i < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; i++)
  {
    if(_allGpiosBeingTimed[i] == NULL)
    {
      _allGpiosBeingTimed[i] = gpioInfoAddr;
      _allGpiosBeingTimedCnt++;
      break;
    }
  }
}

//===============================================================
// Removes from the timer isr
void mint_remove_from_timed_list_and_decr(struct interruptPinMap_s *gpioInfoAddr)
{
  int activeOffset;

  // Find the entry specified
  for(activeOffset = 0; activeOffset < MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS; activeOffset++)
  {
    if(_allGpiosBeingTimed[activeOffset] == gpioInfoAddr)
      break;
  }

  // Was the item in the list?
  if(activeOffset == MEADOW_INTERRUPT_MAX_SUPPORTED_GPIOS)
    return;  // Not found

  // Keep tally of entries
  _allGpiosBeingTimedCnt--;

  // Is this the only entry?
  if(activeOffset == _allGpiosBeingTimedCnt)
  {
    // Remove the last entry in the array
    _allGpiosBeingTimed[activeOffset] = NULL;
    return;
  }
 
  // Compress the list by moving the last entry in the list to the slot we
  // are about to remove and then clearing the last slot.
  _allGpiosBeingTimed[activeOffset] = _allGpiosBeingTimed[_allGpiosBeingTimedCnt];
  _allGpiosBeingTimed[_allGpiosBeingTimedCnt] = NULL;
  return;
}

#if 1
//=============================================================================
// Timer setup is here. This should only be called once to prepare timer for
// for periodic operation.
// Note: Timers 6 & 7 are Basic Timers. Timer 6 is used  measuring CPU idle time
// and Timer 7 is used here. Since neither timer has GPIO this makes these
// available for GPIO related work.
static int mint_config_interrupt_prep_timer(int stm32_timer_numb)
{
  int ret;
  
  // Setup the clock enable
  modifyreg32(STM32_RCC_APB1ENR, 0, RCC_APB1ENR_TIM7EN);
  
  // Must be between 0 and 0xffff. Set the prescaler value of 0 to allow
  // highest speed. A prescaler value of 1 will divide the clock by 2.
  // Find proper pre-scaler value so all timers run at the same speed
  uint16_t prescaler = STM32_APB1_TIM7_CLKIN/MEADOW_INTERRUPT_RUNNING_FREQ;
  prescaler /= 10;
  syslog(1, "--> prescaler value is:%d\n", prescaler);
  putreg16(prescaler, STM32_TIM7_BASE + STM32_BTIM_PSC_OFFSET);

