WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_interrupt.c
  // The value put into the ARR is SMALL
  uint32_t maxARRValue = 10 - 1;
  putreg32(maxARRValue, STM32_TIM7_BASE + STM32_BTIM_ARR_OFFSET);

  uint16_t regval = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
  regval |= BTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
  putreg16(regval, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);

  // Timer 7 only supports UIE interrupt
  putreg16(BTIM_DIER_UIE, STM32_TIM7_BASE + STM32_BTIM_DIER_OFFSET);

  // The ISR for periodic interupt for timing, will roll-over every 65536
  // counts.
  ret = irq_attach(STM32_IRQ_TIM7, mint_isr_periodic, NULL);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed:%d, errno:%d\n",
          __FILE__, __LINE__, ret, errno);
    return ret;
  }

  // Clear interrupt bit
  uint16_t timStatusReg = getreg16(STM32_TIM7_BASE + STM32_GTIM_SR_OFFSET);
  timStatusReg &= ~BTIM_SR_UIF;
  putreg16(timStatusReg, STM32_TIM7_BASE + STM32_GTIM_SR_OFFSET);

  up_enable_irq(STM32_IRQ_TIM7);

  meadow_timer_enable(STM32_TIM7_BASE);
  // turn_periodic_timer_on();

  return OK;
}

//=============================================================
void meadow_timer_enable(uint32_t timerBase)
{
  // Why this order? tryed to copy the NUTTX order
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);

  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}
  // 
  // uint16_t egrVal = getreg16(STM32_TIM7_BASE + STM32_BTIM_EGR_OFFSET);
  // egrVal |= BTIM_EGR_UG;    // Update generation (only bit in EGR)
  // putreg16(egrVal, STM32_TIM7_BASE + STM32_BTIM_EGR_OFFSET);

//=====================================================================
// Setting the Counter Enable bit
static void turn_periodic_timer_on(void)
{
  uint16_t cr1Val = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
  cr1Val |= BTIM_CR1_CEN;   // counter enable
  putreg16(cr1Val, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
}

//=====================================================================
static void turn_periodic_timer_off(void)
{
  uint16_t cr1Val = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
  cr1Val &= ~BTIM_CR1_CEN;   // counter enable
  putreg16(cr1Val, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
}

#else

static int mint_config_interrupt_prep_timer(int stm32_timer_numb)
{
  int ret;
  struct stm32_tim_dev_s *initTimer;

  // For 100 microsec
  // (--) pwm this should be related to STM32_APB2_TIM10_CLKIN and
  // not hardcoded!!!!!
  uint32_t frequency = 1920000;
  uint32_t period = 192 - 1;
  xcpt_t isrHandler = mint_isr_periodic;

  // For future reference
  // -- for 1 microsec --
  // frequency = STM32_APB2_TIM10_CLKIN;
  // period = 192 - 1;
  // -- for 1 millisec --
  // frequency = STM32_APB2_TIM10_CLKIN / 100; // = 1,920,000 MHz
  // period = 1920 - 1;                        // = 1 millisec
  
  initTimer = stm32_tim_init(stm32_timer_numb);
  if(initTimer == NULL)
  {
    syslog(LOG_ERR, "%s@%d-stm32_tim_init returned NULL\n",
          __FILE__, __LINE__);
    return OK;
  }
  
  // This determines the prescaler value 0 - 65535. Nuttx looks up the
  // desired frequency and calculates the correct clock divisor.
  STM32_TIM_SETCLOCK(initTimer, frequency);

  // Increasing period decreases the frequency
  // Sets the Auto Reload Register value
  STM32_TIM_SETPERIOD(initTimer, period);

  // arg (third parameter) is a pointer that's returned in the isr handler
  ret = STM32_TIM_SETISR(initTimer, isrHandler, NULL, 0);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-STM32_TIM_SETISR failed:%d\n",
          __FILE__, __LINE__, ret);
    return ret;
  }

  // Prevent interrupts until needed
  STM32_TIM_SETMODE(initTimer, STM32_TIM_MODE_DISABLED);

  // Finish set up
#if Peters_Hacking > 0
  if(MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER == 10)
  {
    uint16_t timStatusReg = getreg16(STM32_TIM10_BASE + STM32_GTIM_SR_OFFSET);
    timStatusReg &= ~GTIM_SR_UIF;
    putreg16(timStatusReg, STM32_TIM10_BASE + STM32_GTIM_SR_OFFSET);
  }
  else if (MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER == 7)
  {
    uint16_t timStatusReg = getreg16(STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET);
    timStatusReg &= ~BTIM_SR_UIF;
    putreg16(timStatusReg, STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET);
  }
  else
  {
    PANIC();
  }
#else
  STM32_TIM_ACKINT(initTimer, GTIM_SR_UIF);
#endif

  STM32_TIM_ENABLEINT(initTimer, GTIM_DIER_UIE);

  _periodicTimer = initTimer;
  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called from meadow-upd.c to configure or remove a gpio for monitoring
int mint_config_interrupt(struct mint_gpio_int_config* cfg)
{
  int ret;
  struct interruptPinMap_s *gpioInfoAddr;
  uint8_t pinDesignation = cfg->port << 4 | cfg->pin;

  if(cfg->risingEdge == 0 && cfg->fallingEdge == 0)
  {
    return -EINVAL;
  }

  if(_firstTimeConfig)
  {
    _allGpiosBeingTimedCnt = 0;
    _firstTimeConfig = false;
    
    stm32_configgpio(DEBUG_PIN_V2_A0);
    stm32_configgpio(DEBUG_PIN_V2_A1);
    stm32_configgpio(DEBUG_PIN_V2_A2);
    stm32_configgpio(DEBUG_PIN_V2_A3);
    stm32_configgpio(DEBUG_PIN_V2_A4);
    stm32_configgpio(DEBUG_PIN_V2_A5);
    
    stm32_gpiowrite(DEBUG_PIN_V2_A0, false);
    stm32_gpiowrite(DEBUG_PIN_V2_A1, false);
    stm32_gpiowrite(DEBUG_PIN_V2_A2, false);
    stm32_gpiowrite(DEBUG_PIN_V2_A3, false);
    stm32_gpiowrite(DEBUG_PIN_V2_A4, false);
    stm32_gpiowrite(DEBUG_PIN_V2_A5, false);

    // Setup the timer once, the first time
    ret = mint_config_interrupt_prep_timer(MEADOW_INTERRUPT_STM32F7_TIMER_NUMBER);
    if(ret < 0)
    {
      syslog(LOG_ERR, "mint-(cfg)---mint_config_interrupt_prep_timer failed\n");
      return ret;
    }
  }

  // Allocate memory for this GPIO's configuration and data storage needs
  gpioInfoAddr = (struct interruptPinMap_s *) zalloc(sizeof (struct interruptPinMap_s));
  if(gpioInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }

